In [ ]:
import mysql.connector as connection

In [ ]:
mydb = connection.connect(host="localhost", user="", passwd="",use_pure=True)
print(mydb.is_connected())
cur = mydb.cursor()

In [ ]:
# 1- importing dataframe
cur.execute('SELECT * FROM inu_data.glass_data ')
cur.fetchall()

In [ ]:
# 2- Gettting Columns
cur.execute("show columns from inu_data.glass_data")
cur.fetchall()

In [ ]:
# 3- Total Rows
cur.execute("SELECT COUNT(*) FROM inu_data.glass_data")
cur.fetchall()

In [ ]:
# 4 - Selecting Columns
cur.execute("SELECT RI, Na, Mg FROM inu_data.glass_data")
cur.fetchall()

In [ ]:
# 5 - Filtering
cur.execute(" SELECT * FROM inu_data.glass_data WHERE RI=1.51742;")
cur.fetchall()

In [ ]:
# 6 - Selecting Top 5 rows
cur.execute(" SELECT * FROM inu_data.glass_data LIMIT 5;")
cur.fetchall()

In [ ]:
# 7 - Using greater than operator
cur.execute(" SELECT * FROM inu_data.glass_data where RI > 1.51740;")
cur.fetchall()

In [ ]:
# 8 - Order By
cur.execute(" SELECT * FROM inu_data.glass_data ORDER BY RI ;")
cur.fetchall()

In [ ]:
# 9 - Finding Minimum Number
cur.execute(" SELECT MIN(RI) FROM inu_data.glass_data")
cur.fetchall()

In [ ]:
# 10 - Finding Max Number
cur.execute(" SELECT MAX(RI) FROM inu_data.glass_data")
cur.fetchall()

In [ ]:
# 11 - Finding Average Values
cur.execute(" SELECT AVG(RI) FROM inu_data.glass_data")
cur.fetchall()

In [ ]:
# 12 Finding Sum Of column
cur.execute(" SELECT SUM(RI), SUM(Na) FROM inu_data.glass_data")
cur.fetchall()

In [ ]:
# 13 using like operator
cur.execute("SELECT Mg FROM inu_data.glass_data where Mg like '%4.4%';")
cur.fetchall()

In [ ]:
# 14 BETWEEN operator
cur.execute("SELECT Mg FROM inu_data.glass_data where Mg Between 3 and 3.8;")
cur.fetchall()

In [ ]:
# 15 Not BETWEEN operator
cur.execute("SELECT Mg FROM inu_data.glass_data where Mg not Between 3 and 3.8;")
cur.fetchall()

In [ ]:
# 16 using IS NULL
cur.execute("SELECT * FROM inu_data.glass_data where Mg is null;")
cur.fetchall()

In [ ]:
# 17 Drop DB
cur.execute("DROP DATABASE student234;")
cur.fetchall()

In [ ]:
# 18 - Creating New db
cur.execute("CREATE DATABASE students_data;")
cur.fetchall()

In [ ]:
# 19 - Creating New Table
#cur.execute("USE students_data;")
cur.execute("CREATE TABLE student_dim(Reg_Number INTEGER, First_Name VARCHAR(15),Last_Name VARCHAR(15), Age INTEGER, PRIMARY KEY(Reg_Number));")
cur.fetchall()

In [ ]:
# 20 - Inserting Values
cur.execute("INSERT INTO student_dim VALUES(3848, 'Jacob', 'Lee', 21 );")
mydb.commit()

In [ ]:
# 21 - Inserting Multiple Values
cur.execute("INSERT INTO student_dim VALUES (4545, 'Jude', 'lay', 22)")
cur.execute("INSERT INTO student_dim VALUES (4546, 'Hassi', 'M', 26)")
cur.execute("INSERT INTO student_dim VALUES (4547, 'Idris', 'Elba',24 )")
cur.execute("INSERT INTO student_dim VALUES (4455, 'Tom', 'Hid',26 )")

In [ ]:
mydb.commit()

In [ ]:
# 22 New Table
cur.execute("USE students_data")
cur.execute("CREATE TABLE marks(subject VARCHAR(25), student_id INTEGER, FOREIGN KEY(student_id) REFERENCES student_dim(Reg_Number));")

In [ ]:
cur.execute("DROP TABLE marks")

In [ ]:
# 23 Mutiple Executions
cur.execute("INSERT INTO marks VALUES('Data Engineering', 4545);")
cur.execute("INSERT INTO marks VALUES('Data Science', 4546);")
cur.execute("INSERT INTO marks VALUES('Data Analysis', 4545);")
cur.execute("INSERT INTO marks VALUES('Web Development', 3848);")
cur.execute("INSERT INTO marks VALUES('Block Chain Development', 4545);")
cur.execute("INSERT INTO marks VALUES('Deep Learning', 4547);")
cur.execute("INSERT INTO marks VALUES(NULL, 4455);")

In [ ]:
mydb.commit()

In [ ]:
# 24 -joining to two tables 
cur.execute("SELECT s.First_Name,s.Last_Name,s.Age, m.subject FROM student_dim AS s right join marks AS m on s.Reg_Number = m.student_id ")
cur.fetchall()

In [ ]:
# 25 - ALTER TABLE 
cur.execute("ALTER TABLE student_dim ADD admission_date DATE")

In [ ]:
cur.execute("INSERT INTO student_dim(admission_date, Reg_Number) VALUES('2021-04-15', 4433)")

In [ ]:
mydb.commit()

In [ ]:
# 26- Getting Data Points With Null Values
cur.execute("SELECT First_Name, Last_Name, Age FROM student_dim WHERE admission_date IS NULL")
cur.fetchall()